import React from 'react'

function Main() {
  return (
    <div>
            
        <div style={{ marginTop: '80px', marginLeft: '20px' }}>
          <h3>페이지 설명서</h3>
          <p>이 제품은 테이블을 직접 추가하여 자신이 필요한 페이지를 직접 구현할 수 있는 No-Code 플랫폼입니다.</p>
          <p>해당 제품에 가능성이 보일 때 추가적인 고도화를 진행하겠습니다.</p>
          
          <br />
          <br />
          <p>테이블 : 데이터베이스 추가 및 사용할 컬럼</p>
          <p>메뉴 : 메뉴를 만들고 만든 테이블로 페이지를 만드는 곳</p>
        
          <br />
        <br />
        
          <ul>
            <li>1. '테이블 목록' 페이지에서 필요한 테이블을 생성합니다.</li>
            <li>
              2. 생성한 테이블에 들어가 필요한 필드(컬럼)를 만들어줍니다. <br />
              &nbsp;&nbsp;&nbsp;&nbsp;(현재는 텍스트와 숫자만 넣을 수 있습니다.)
            </li>
            <li>3. 필드 생성 후 순서 변경이 필요하면 드래그 드롭을 통해 순서를 변경할 수 있고, X 버튼을 통해 필드를 삭제할 수 있습니다.</li>
            <li>4. 레코드 생성은 테이블을 통해 만든 이후에 해당 테이블과 비슷한 형태의 페이지를 구현할 수 있게 해줍니다. </li>
            <li>5. '레코드 화면 관리' 페이지는 '테이블 목록' 페이지에서 접속할 수가 있으며, 실제로 화면에 나타내고자 하는 필드를 컨트롤 할 수 있습니다.</li>
            <li>2. </li>
            <li>2. </li>
            </ul>
          </div>

    </div>
  )
}

export default Main